kAMDSuccess = "Non si è verificato alcun errore.";
kAMDUndefinedError = "Si è verificato un errore sconosciuto.";
kAMDBadHeaderError = "Impossibile trasferire il documento.";
kAMDNoResourcesError = "Impossibile allocare una risorsa.";
kAMDReadError = "Impossibile leggere dal dispositivo.";
kAMDWriteError = "Impossibile scrivere sul dispositivo.";
kAMDUnknownPacketError = "Pacchetto sconosciuto.";
kAMDInvalidArgumentError = "L'argomento non è valido.";
kAMDNotFoundError = "Impossibile trovare il documento.";
kAMDIsDirectoryError = "Il percorso è una directory.";
kAMDPermissionError = "Non disponi di privilegi.";
kAMDNotConnectedError = "Non connesso al dispositivo.";
kAMDTimeOutError = "Operazione scaduta.";
kAMDOverrunError = "Si è verificato un sovraccarico del buffer.";
kAMDEOFError = "Fine del documento.";
kAMDUnsupportedError = "Questa operazione non è supportata.";
kAMDFileExistsError = "Il documento esiste già.";
kAMDBusyError = "Il dispositivo è occupato.";
kAMDCryptoError = "Impossibile stabilire una connessione sicura con il dispositivo.";
kAMDTooBigError = "Il messaggio è troppo grande.";
kAMDInvalidResponseError = "Risposta inattesa ricevuta dal dispositivo.";
kAMDMissingKeyError = "Chiave mancante.";
kAMDMissingValueError = "Valore mancante.";
kAMDGetProhibitedError = "Impossibile recuperare valore dal dispositivo protetto da codice di accesso.";
kAMDSetProhibitedError = "Impossibile impostare il valore del dispositivo.";
kAMDRemoveProhibitedError = "Impossibile rimuovere il valore del dispositivo.";
kAMDImmutableValueError = "Impossibile modificare il valore.";
kAMDPasswordProtectedError = "Dispositivo protetto da codice di accesso.";
kAMDMissingHostIDError = "Il dispositivo non riconosce questo host.";
kAMDInvalidHostIDError = "Il dispositivo non riconosce questo host.";
kAMDSessionActiveError = "La sessione è attiva.";
kAMDSessionInactiveError = "La sessione non è attiva.";
kAMDMissingSessionIDError = "ID sessione mancante.";
kAMDInvalidSessionIDError = "ID sessione non valida.";
kAMDMissingServiceError = "Il servizio non è disponibile.";
kAMDInvalidServiceError = "Il servizio non è valido.";
kAMDServiceLimitError = "Troppe istanze di questo servizio sono già in esecuzione.";
kAMDCheckinSetupFailedError = "Impossibile avviare il servizio sul dispositivo";
kAMDInvalidCheckinError = "Impossibile avviare il servizio sul dispositivo";
kAMDCheckinTimeoutError = "Incorretto avvio del servizio sul dispositivo.";
kAMDCheckinConnectionFailedError = "Incorretto avvio del servizio sul dispositivo.";
kAMDCheckinReceiveFailedError = "Incorretto avvio del servizio sul dispositivo.";
kAMDCheckinResponseFailedError = "Incorretto avvio del servizio sul dispositivo.";
kAMDCheckinOutOfMemoryError = "Incorretto avvio del servizio sul dispositivo.";
kAMDCheckinSendFailedError = "Incorretto avvio del servizio sul dispositivo.";
kAMDMissingPairRecordError = "L'host non è abbinato con il dispositivo.";
kAMDInvalidPairRecordError = "L'host non è più abbinato con il dispositivo.";
kAMDSavePairRecordFailedError = "Impossibile registrare il record di abbinamento.";
kAMDInvalidActivationRecordError = "Il record di attivazione non è valido.";
kAMDMissingActivationRecordError = "Impossibile trovare il record di attivazione.";
kAMDServiceProhibitedError = "Impossibile avviare il servizio sul dispositivo.";
kAMDEscrowLockedError = "Dispositivo non disponibile fino al primo sblocco dopo l'avvio.";
kAMDProhibitedBySupervision = "Operazione proibita su dispositivi supervisionati.";
kAMDPairingProhibitedError = "Abbinamento consentito solo via USB.";
kAMDWrongDroidError = "Dispositivo in modalità di recupero.";
kAMDSUVerificationError = "Impossibile verificare il pacchetto di aggiornamento del software.";
kAMDSUPatchError = "Impossibile applicare patch al documento.";
kAMDSUFirmwareError = "Impossibile aggiornare il firmware.";
kAMDProvisioningProfileNotValid = "Profilo di fornitura non valido.";
kAMDSendMessageError = "Impossibile inviare un messaggio al dispositivo.";
kAMDReceiveMessageError = "Impossibile ricevere un messaggio dal dispositivo.";
kAMDMissingOptionsError = "Opzioni mancanti.";
kAMDMissingImageTypeError = "Immagine mancante.";
kAMDDigestFailedError = "Impossibile leggere immagine disco.";
kAMDStartServiceError = "Impossibile avviare il servizio.";
kAMDInvalidDiskImageError = "Immagine disco non valida.";
kAMDMissingDigestError = "Digest mancante.";
kAMDMuxError = "Si è verificato un errore con il multiplexor dispositivo USB.";
kAMDApplicationAlreadyInstalledError = "Sul dispositivo è già stata installata un'applicazione di sistema con un particolare identificatore bundle e non può essere sostituita.";
kAMDApplicationMoveFailedError = "Impossibile spostare l'applicazione sul dispositivo.";
//kAMDApplicationSINFCaptureFailedError = "";
kAMDApplicationSandboxFailedError = "Impossibile eseguire applicazione in Sandbox.";
kAMDApplicationVerificationFailedError = "Impossibile verificare l'applicazione.";
kAMDArchiveDestructionFailedError = "Impossibile rimuovere l'archivio dell'applicazione.";
kAMDBundleVerificationFailedError = "Impossibile verificare il carrier bundle.";
kAMDCarrierBundleCopyFailedError = "Impossibile creare la directory del carrier bundle.";
kAMDCarrierBundleDirectoryCreationFailedError = "Impossibile creare la directory del carrier bundle.";
kAMDCarrierBundleMissingSupportedSIMsError = "Non vi sono SIM supportate per questo carrier bundle.";
kAMDCommCenterNotificationFailedError = "Impossibile ascoltare notifica dalla banda base.";
kAMDContainerCreationFailedError = "Impossibile creare il contenitore dell'applicazione.";
kAMDContainerP0wnFailedError = "Impossibile ripristinare il contenitore dell'applicazione.";
kAMDContainerRemovalFailedError = "Impossibile rimuovere il contenitore dell'applicazione.";
kAMDEmbeddedProfileInstallFailedError = "Impossibile installare il profilo di fornitura incorporato.";
kAMDErrorError = "Si è verificato un errore.";
kAMDExecutableTwiddleFailedError = "Impossibile modificare i permessi di esecuzione dell'applicazione.";
kAMDExistenceCheckFailedError = "Impossibile verificare l'esistenza dell'applicazione.";
kAMDInstallMapUpdateFailedError = "Impossibile aggiornare l'elenco delle applicazioni installate.";
kAMDManifestCaptureFailedError = "Impossibile registrare il manifesto dell'applicazione.";
kAMDMapGenerationFailedError = "Impossibile generare la mappa.";
kAMDMissingBundleExecutableError = "Il bundle dell'applicazione non contiene un eseguibile.";
kAMDMissingBundleIdentifierError = "Il bundle dell'applicazione non contiene un identificatore valido.";
kAMDMissingBundlePathError = "Impossibile determinare il percorso del bundle dell'applicazione.";
kAMDMissingContainerError = "Impossibile trovare il contenitore dell'applicazione installata.";
kAMDNotificationFailedError = "Impossibile inviare una notifica.";
kAMDPackageExtractionFailedError = "Impossibile aprire il pacchetto dell'applicazione.";
kAMDPackageInspectionFailedError = "Impossibile esaminare il pacchetto dell'applicazione.";
kAMDPackageMoveFailedError = "Impossibile spostare il pacchetto dell'applicazione nel percorso di gestione temporanea.";
kAMDPathConversionFailedError = "Impossibile convertire il percorso.";
kAMDRestoreContainerFailedError = "Impossibile ripristinare il contenitore dell'applicazione.";
kAMDSeatbeltProfileRemovalFailedError = "Impossibile rimuovere il profilo seatbelt dell'applicazione.";
kAMDStageCreationFailedError = "Impossibile creare la directory di gestione temporanea.";
kAMDSymlinkFailedError = "Impossibile creare il symlink.";
kAMDiTunesArtworkCaptureFailedError = "Impossibile registrare l'illustrazione di iTunes.";
kAMDiTunesMetadataCaptureFailedError = "Impossibile registrare i metadati di iTunes.";
kAMDAlreadyArchivedError = "L'applicazione è già archiviata.";
kAMDUnknownCommandError = "Il dispositivo non riconosce il comando.";
kAMDAPIInternalError = "Si è verificato un errore API interno.";
kAMDMuxCreateListenerError = "Impossibile ascoltare dispositivi USB.";
kAMDMuxGetListenerError = "Impossibile trovare il dispositivo di ascolto USB.";
kAMDMuxConnectError = "Impossibile connettersi al dispositivo.";
kAMDDeviceTooNewError = "Questa applicazione deve essere aggiornata.";
kAMDDeviceRefNoGood = "Questo dispositivo non è più connesso.";
kAMDDeviceDisconnectedError = "Questo dispositivo non è più connesso.";
kAMDCannotTranslateError = "Impossibile trasferire messaggi dal dispositivo.";
kAMDMobileImageMounterMissingImageSignature = "Impossibile supportare sviluppo.";
kAMDMobileImageMounterResponseCreationFailed = "Impossibile supportare sviluppo.";
kAMDMobileImageMounterMissingImageType = "Impossibile supportare sviluppo.";
kAMDMobileImageMounterMissingImagePath = "Impossibile supportare sviluppo.";
kAMDMobileImageMounterImageMapLoadFailed = "Impossibile supportare sviluppo.";
kAMDMobileImageMounterAlreadyMounted = "Impossibile supportare sviluppo.";
kAMDMobileImageMounterImageMoveFailed = "Impossibile supportare sviluppo.";
kAMDMobileImageMounterMountPathMissing = "Impossibile supportare sviluppo.";
kAMDMobileImageMounterMountPathNotEmpty = "Impossibile supportare sviluppo.";
kAMDMobileImageMounterImageMountFailed = "Impossibile supportare sviluppo.";
kAMDMobileImageMounterTrustCacheLoadFailed = "Impossibile supportare sviluppo.";
kAMDMobileImageMounterDigestFailed = "Impossibile supportare sviluppo.";
kAMDMobileImageMounterDigestCreationFailed = "Impossibile supportare sviluppo.";
kAMDMobileImageMounterImageVerificationFailed = "Impossibile supportare sviluppo.";
kAMDMobileImageMounterImageInfoCreationFailed = "Impossibile supportare sviluppo.";
kAMDMobileImageMounterImageMapStoreFailed = "Impossibile supportare sviluppo.";
kAMDDeviceOSVersionTooLow = "Versione OS dispositivo troppo bassa. ";
kAMDNoWifiSyncSupportError = "Il dispositivo non supporta la sincronizzazione wireless.";
kAMDDeviceFamilyNotSupported = "L'app non supporta questo tipo di dispositivo.";
kAMDPackagePatchFailedError = "Impossibile applicare l'aggiornamento patch all'app.";
kAMDIncorrectArchitectureError = "L'app non supporta il tipo di CPU di questo dispositivo.";
kAMDPluginCopyFailedError = "impossibile copiare il plugin VPN nel contenitore dell'app.";
kAMDBreadcrumbFailedError = "Impossibile scrivere breadcrumb installazione.";
kAMDBreadcrumbUnlockError = "Impossibile aggiornare breadcrumb installazione.";
kAMDGeoJSONCaptureFailedError = "Impossibile salvare i dati GeoJSON.";
kAMDNewsstandArtworkCaptureFailedError = "Impossibile salvare l'illustrazione Newsstand.";
kAMDMissingCommandError = "La richiesta non contiene un comando.";
kAMDNotEntitledError = "L'app non è autorizzata a effettuare questa richiesta.";
kAMDMissingPackagePathError = "Nella richiesta mancava il percorso del pacchetto.";
kAMDMissingContainerPathError = "Nella richiesta mancava il percorso del container.";
kAMDMissingApplicationIdentifierError = "Nella richiesta mancava l'identificatore dell'app.";
kAMDMissingAttributeValueError = "Nella richiesta mancava un valore necessario.";
kAMDLookupFailedError = "Impossibile elencare le app installate.";
kAMDDictCreationFailedError = "Impossibile estrarre funzionalità dalla richiesta.";

/* kMISFileError */
"A file operation failed." = "Operazione su documento fallita.";

/* kMISModifiedResourcesError */
"A signed resource has been added, modified, or deleted." = "È stata aggiunta, modificata o eliminata una risorsa firmata.";

/* kMISInvalidSignerError */
"A valid provisioning profile for this executable was not found." = "Impossibile trovare un profilo di provisioning valido per l'eseguibile. ";

/* kMISUnknownError */
"An unknown error has occurred." = "Si è verificato un errore sconosciuto.";

/* kMISNotMutableError */
"Attempted to modify an immutable provisioning profile." = "Tentativo di modifica di un profilo di provisioning immutabile.";

/* kMISApplicationSignatureNotValidError */
"The application does not have a valid signature." = "L'applicazione non ha una firma valida.";

/* kMISApplicationSignatureNotValidError */
"The application's signature is valid but it does not match the expected hash." = "La firma dell'applicazione è valida ma non corrisponde all'hash attesto.";

/* kMISAdHocSignatureError */
"The executable contains an invalid signature." = "L'eseguibile contiene una firma non valida.";

/* kMISInvalidEntitlementError */
"The executable was signed with invalid entitlements." = "Eseguibile firmato con adesioni non valide.";

/* kMISInvalidSignerCertError */
"The identity used to sign the executable is no longer valid." = "L'identità usata per firmare l'eseguibile non è più valida.";

/* kMISSignatureNotValidError */
"The signature was not valid." = "La firma non è valida.";

/* kMISConnectionClosedError */
"There was an error communicating with your device." = "Errore durante la comunicazione con il dispositivo. ";

/* kMISUnsupportedDeviceError */
"This provisioning profile cannot be installed on this device." = "Impossibile installare il profilo di provisioning sul dispositivo.";

/* kMISProfileSignatureNotValidError */
"This provisioning profile does not have a valid signature (or it has a valid, but untrusted signature)." = "Il profilo di provisioning non ha una firma valida (oppure ha una firma valida ma non attendibile).";

/* kMISExpiredError */
"This provisioning profile has expired." = "Il profilo di provisioning è scaduto.";

/* kMISMalformedProfileError */
"This provisioning profile is malformed." = "Il profilo di provisioning non è corretto.";

/* kMISUnsupportedVersionError */
"This provisioning profile is unsupported." = "Il profilo di provisioning non è supportato.";

/* kMISAllocationError */
"Unable to allocate memory." = "Impossibile allocare memoria.";

